In [1]:
print("this is python jupyter")

this is python jupyter

In [2]:
for n in range(1,11):
    print(n)

1
2
3
4
5
6
7
8
9
10

In [3]:
import pandas as pd

In [5]:
df=pd.DataFrame({
    "name":["ajit","karthik","sachin"],
    "city":["mumbai","pune","nashil"]
})

In [6]:
df

      name    city
0     ajit  mumbai
1  karthik    pune
2   sachin  nashil

In [7]:
df["city"]

0    mumbai
1      pune
2    nashil
Name: city, dtype: object

In [8]:
df["name"]

0       ajit
1    karthik
2     sachin
Name: name, dtype: object

In [9]:
wheaher_data = [(1,32,6,"rain"),(2,35,5,"sunny"),(3,38,5,"sunny"),(4,31,5,"snow")]

In [10]:
wheaher_data

[(1, 32, 6, 'rain'),
 (2, 35, 5, 'sunny'),
 (3, 38, 5, 'sunny'),
 (4, 31, 5, 'snow')]

In [11]:
df1= pd.DataFrame(data=wheaher_data, columns=["day","temperature","windspeed","event"])

In [12]:
df1

   day  temperature  windspeed  event
0    1           32          6   rain
1    2           35          5  sunny
2    3           38          5  sunny
3    4           31          5   snow